resources/processCheckout.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="tns:ns">
    <soapenv:Header>
        <tns:CheckOutHeader>
            <MERCHANT_ID>?</MERCHANT_ID>
            <PASSWORD>?</PASSWORD>
            <TIMESTAMP>?</TIMESTAMP>
        </tns:CheckOutHeader>
    </soapenv:Header>
    <soapenv:Body>
        <tns:processCheckOutRequest>
            <MERCHANT_TRANSACTION_ID>?</MERCHANT_TRANSACTION_ID>
            <REFERENCE_ID>?</REFERENCE_ID>
            <AMOUNT>?</AMOUNT>
            <MSISDN>?</MSISDN>
            <!--Optional:-->
            <ENC_PARAMS>?</ENC_PARAMS>
            <CALL_BACK_URL>?</CALL_BACK_URL>
            <CALL_BACK_METHOD>?</CALL_BACK_METHOD>
            <!--Optional:-->
            <TIMESTAMP>?</TIMESTAMP>
        </tns:processCheckOutRequest>
    </soapenv:Body>
</soapenv:Envelope>